categories = ["穀物","野菜","果物・フルーツ","乳製品","肉・魚","豆類・ナッツ","香辛料・スパイス","調味料","飲み物","その他"]

foods = [
  #穀物
  [
    ["米","玄米","米粉類","十割蕎麦","グルテンフリーの食品","オート麦","シリアル（米、オート麦）","タコス","スターチ","コーンスターチ","ポップコーン""タピオカ","ポテトチップス（少量）","オートミール","コーンミール","ビーフン","フォー"],
    ["大麦","小麦","ライ麦","パン","ラーメン（小麦)","パスタ","うどん","そうめん","とうもろこし","ピザ","お好み焼き","たこ焼き","シリアル（大麦、小麦、オリゴ糖、ドライフルーツ、ハチミツを含むもの）","ケーキ","パイ","パンケーキ"],
  ],
  #野菜
  [
    ["なす","トマト、ミニトマト","ブロッコリー(半カップまで)","にんじん","ピーマン","唐辛子","ほうれん草","かぼちゃ","きゅうり","じゃがいも","しょうが","おくら","レンコン","レタス","たけのこ","もやし","チンゲン菜","白菜","かぶ","キャベツ","ヤム芋","ズッキーニ","パセリ","ラディッシュ","オリーブ","パクチー","大根","エシャロット","ルッコラ"],
    ["アスパラガス","豆類（大豆、さやえんどう、ひよこ豆、レンズ豆、あずき）","納豆","ゴーヤ","ねぎ","わけぎ","玉ねぎ","にんにく","にら","カリフラワー","ごぼう","セロリ","キムチ","フライドポテト","きくいも","さつまいも","マッシュルーム","らっきょう","サボイキャベツ","ちりめんキャベツ","たろいも","キノコ全般"]
  ],
  #果物・フルーツ
  [
    ["バナナ","ココナッツ","キウイ","レモン","キンカン","ザボン","ライム","ラズベリー","ブルーベリー(20粒以下)","クランベリー","ドリアン","ドラゴンフルーツ"],
    ["りんご","すいか","あんず","もも","なし","グレープフルーツ","アボカド","ライチ","柿","西洋梨","さくらんぼ","干しぶどう","プルーン","ざくろ","ブラックベリー","いちじく","グアバ","すもも","プラム","マンゴー","ドライフルーツ","メロン","ぶどう","みかん","オレンジ","パイナップル","甘いいちご","パパイヤ"]

  ],
  #乳製品
  [
    ["ラクトース抜きの牛乳","バター","マーガリン（牛乳を含まないもの）","ラクトフリー製品（乳糖が入っていないもの）","アーモンドミルク","スキムミルク","ブリ―チーズ","バターチーズ","カマンベールチーズ","チェダーチーズ","ゴルゴンゾーラチーズ","モッツァレラチーズ","パルメザンチーズ"],
    ["牛乳","乳糖を含む乳製品全般","ヨーグルト","アイスクリーム","クリーム全般","ラッシー","ミルクチョコレート","ホエイチーズ","プロセスチーズ","カッテージチーズ","ブルーチーズ","クリームチーズ","プリン"]
  ],
  #肉・魚
  [
    ["ベーコン","ハム","豚肉","牛肉（赤身）","鶏肉","羊肉","七面鳥","魚介類","海苔","昆布","わかめ"],
    ["缶詰の魚","ソーセージ","佃煮"]
  ],
  #豆類・ナッツ
  [
    ["アーモンド（10粒以下）","ヘーゼルナッツ(10粒以下)","くるみ","ピーナッツ(32粒以下)","栗"],
    ["カシューナッツ","ピスタチオ","アーモンド（20粒以上）","あずき"]
  ],
  #香辛料・スパイス
  [
    ["ミント","バジル","カレー粉","チリパウダー","パプリカパウダー","唐辛子","パセリ","シナモン","マスタード","クローブ","ラベンダー"],
    ["わさび","しょうが","コンソメ"]
  ],
  #調味料
  [
    ["マヨネーズ（小さじ3まで）","オリーブオイル","酢","缶詰のトマト","ココア","ごま油","魚油","キャノーラ油","オイスターソース","マーマレード","ピーナッツバター","メープルシロップ","味噌","塩コショウ","片栗粉","みりん"],
    ["ハチミツ","オリゴ糖","コーンシロップ","ココナッツミルク","アップルソース","トマトケチャップ","カスタード","バーベキューソース","カレーソースブイヨン","缶詰のフルーツ","固形スープの素","バルサミコ酢豆乳（大豆由来）"]
  ],
  #飲み物
  [
    ["紅茶","コーヒー（ストレート）","緑茶","レモンジュース","ライムジュース","クランベリージュース","ジン","ウォッカ","ビール","ウイスキー","甘くないワイン","甘くないスパークリングワイン","タピオカティー","チャイ（薄いもの）","レモネード（無糖）","水、ミネラルウォーター","白茶（ホワイトティー・中国茶）","日本酒"],
    ["アップルジュース","マンゴージュース","オレンジジュース","梨ジュース","フルーツジュース","レモネード（加糖）","ウーロン茶","ハーブティー","麦芽コーヒー","シリアルコーヒー（穀物飲料）","チャイ","カモミールティー","ハチミツ入りジュース","エナジードリンク","マルチビタミンドリンク","ポートワイン","ラム"]
  ],
  #その他
  [
    ["卵","硬い木綿豆腐","酵母","豆乳（大豆抽出物由来）","ゴマ","白玉粉","油揚げ"],
    ["絹ごし豆腐","寄せ豆腐","おから","とんかつ","からあげ","天ぷら","あんこ","きな粉","梅干し"]
  ]
]

categories.each do |c|
  Category.create(name: c)
end

n = 0
foods.each do |value|
  n += 1
  value[0].each do |v|
    Food.create(name: v, fod: 1, category_id: n)
  end
  value[1].each do |v|
    Food.create(name: v, fod: 2, category_id: n)
  end
end